I tried this setup. It doesn't work for me as well.

> I can't reproduce it.
> 
> % cat istio.tf
> 
> ```
> resource "helm_release" "istio-base" {
>   chart            = "base"
>   namespace        = "istio-system"
>   create_namespace = "true"
>   name             = "istio-base"
>   version          = "1.15.3"
>   repository       = "https://istio-release.storage.googleapis.com/charts"
>   #force_update     = var.force_update
>   #recreate_pods    = var.recreate_pods
> }
> 
> resource "helm_release" "istiod" {
>   depends_on        = [helm_release.istio-base]
>   name              = "istiod"
>   namespace         = "istio-system"
>   dependency_update = true
>   repository        = "https://istio-release.storage.googleapis.com/charts"
>   chart             = "istiod"
>   version           = "1.15.3"
>   atomic            = true
>   lint              = true
> }
> 
> 
> 
> terraform {
>   required_providers {
>     helm = {
>       version = "= 2.7.1"
>     }
>   }
> 
>   required_version = "= 1.3.3"
> }
> 
> provider "helm" {
>   kubernetes {
>     config_path = "~/.kube/config"
>   }
> }
> ```
> 
> In the folder with this single `istio.tf` file I run:
> 
> ```
> minikube start
> terraform init -upgrade
> terraform plan
> ```
> 
> Here is my output:
> 
> ```
> % terraform plan
> 
> Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
>   + create
> 
> Terraform will perform the following actions:
> 
>   # helm_release.istio-base will be created
>   + resource "helm_release" "istio-base" {
>       + atomic                     = false
>       + chart                      = "base"
>       + cleanup_on_fail            = false
>       + create_namespace           = true
>       + dependency_update          = false
>       + disable_crd_hooks          = false
>       + disable_openapi_validation = false
>       + disable_webhooks           = false
>       + force_update               = false
>       + id                         = (known after apply)
>       + lint                       = false
>       + manifest                   = (known after apply)
>       + max_history                = 0
>       + metadata                   = (known after apply)
>       + name                       = "istio-base"
>       + namespace                  = "istio-system"
>       + pass_credentials           = false
>       + recreate_pods              = false
>       + render_subchart_notes      = true
>       + replace                    = false
>       + repository                 = "https://istio-release.storage.googleapis.com/charts"
>       + reset_values               = false
>       + reuse_values               = false
>       + skip_crds                  = false
>       + status                     = "deployed"
>       + timeout                    = 300
>       + verify                     = false
>       + version                    = "1.15.3"
>       + wait                       = true
>       + wait_for_jobs              = false
>     }
> 
>   # helm_release.istiod will be created
>   + resource "helm_release" "istiod" {
>       + atomic                     = true
>       + chart                      = "istiod"
>       + cleanup_on_fail            = false
>       + create_namespace           = false
>       + dependency_update          = true
>       + disable_crd_hooks          = false
>       + disable_openapi_validation = false
>       + disable_webhooks           = false
>       + force_update               = false
>       + id                         = (known after apply)
>       + lint                       = true
>       + manifest                   = (known after apply)
>       + max_history                = 0
>       + metadata                   = (known after apply)
>       + name                       = "istiod"
>       + namespace                  = "istio-system"
>       + pass_credentials           = false
>       + recreate_pods              = false
>       + render_subchart_notes      = true
>       + replace                    = false
>       + repository                 = "https://istio-release.storage.googleapis.com/charts"
>       + reset_values               = false
>       + reuse_values               = false
>       + skip_crds                  = false
>       + status                     = "deployed"
>       + timeout                    = 300
>       + verify                     = false
>       + version                    = "1.15.3"
>       + wait                       = true
>       + wait_for_jobs              = false
>     }
> 
> Plan: 2 to add, 0 to change, 0 to destroy.
> ```

